Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN Who's Mr. President.tmx
Source language: id
Languages: en

source: Mereka menyebar agar tidak mencurigakan.
en: they’re spreading to avoid suspicion.

source: Drrrt-
en: Bzzt

source: AKAN LANGSUNG
en: get straight

source: HAL INI?
en: up?

source: KEREN…
en: today...

source: Aku akan memperingati anggota OSIS lainnya agar lebih waspada.
en: I’ll tell the other OSIS members to stay alerted.

source: KARENA ITU KAMI
en: That’s why

source: Kemarin juga
en: Yesterday, you asked

source: Y-YAH, BEGITULAH...
en: ah, I’m lost for words.

source: INI SENDIRIAN.
en: all by yourself.

source: Lakukan saja,
en: Just do it.

source: PAK NEV PASTI
en: Mr. Nevada must have

source: BERSUNGGUH-SUNGGUH
en: with

source: ,,,KALIAN INGAT 'KAN, KEJADIAN YANG DICERITAKAN KEPSEK?
en: do you guys remember that incident the principal told us...

source: ITU BERTEMU…
en: her!

source: TAPI APA BENAR SI KEVIN INI MELAKUKANNYA MURNI HANYA KARENA DIA ORANG YANG BAIK DAN RAMAH, SEPERTI GOSIPNYA?
en: but is this kevin really a good and decent guy like what they say?

source: ARTINYA TEMAN-
en: my friends,

source: KEUNTUNGAN APA-APA
en: gain

source: …AKU BARU
en: I’ve just heard

source: K-KAU SUDAH
en: Have you finished

source: APA PADA CHIARA?
en: any explanation at all?

source: KASUS SPESIAL, MISALNYA
en: such as

source: ORANG YANG MENGAKU
en: the “president” of

source: ORANG INI
en: gonna do

source: SAAT AKU
en: When

source: Karena kalian
en: You two

source: E-EEEH!??
en: H-huh?!

source: TAPI MEREKA TIDAK PERNAH KETAHUAN KARENA MEREKA PUNYA KONEKSI DENGAN POLITIKUS.
en: but nobody can touch them because of their strong connection with politicians.

source: KARENA ITU SAYA MEMINTA EZRA SENDIRI YANG MENGAKUI IDENTITASNYA, KARENA DENGAN BEGITU DIA AKAN MENCERITAKAN JUGA KASUS ERLANGGA.
en: because of that, I asked ezra to reveal his true identity. that way, he'd also be able to reveal the erlangga case.

source: MENGADU DOMBA
en: create a rift

source: KAMU FOKUS
en: Just

source: APAKAH SAYA
en: Am i really

source: KENAPA
en: why is

source: RASANYA SEPERTI
en: left in the dark,

source: TOH??
en: to gossip...

source: KENAPA KAMU
en: How could you

source: junior…?
en: a junior?

source: ORANG YANG SALAH,
en: wrong person.

source: PAK NEV JUGA MENDEDIKASIKAN DIRI SEBAGAI GURU, MESKIPUN DIA BISA SAJA MELANJUTKAN BISNIS KELUARGANYA!
en: he’s also dedicating himself to being a teacher even though he could just run his family’s business!

source: ADMIN SEKOLAH
en: texted me and

source: SEPERTI DIA PEDULI
en: someone like him

source: SAYA TIDAK BISA.
en: but I just couldn’t do it.

source: A-APAA!!?
en: wh-what?!

source: AKU AKAN MEMBERIKAN
en: I always

source: S-SEBENTAR, CHIARA.
en: w-wait, chiara.

source: SUDAH, SUDAH.
en: there, there.

source: …DAN YANG
en: What’s worse

source: RASANYA INGIN
en: Ah... I want

source: TERJADI PADAMU,
en: that might happen to you.

source: ITU MEMBUAT SAYA YAKIN, KALAU DIA AKAN BERSEDIA MENJADI OSIS KALAU ADA HAL YANG BERKAITAN DENGAN TEMANNYA.
en: that convinced me that she would join osis if it was for the benefit of her friends.

source: KASIH MISS
en: you

source: DIA TIDAK
en: Maybe

source: DITAMBAH LAGI, DIA PUNYA RASA KEADILAN YANG TINGGI.
en: plus, she has a strong sense of justice.

source: KEJADIAN KAK
en: about the incident

source: SEKOLAH PUN,
en: the school,

source: SEBENARNYA AKU
en: I’m a little

source: DENGAN SAYA?
en: yet, huh?

source: HEH, RUPANYA
en: Tsk, I

source: SIH!??
en: not to like her?!

source: TOK
en: knock

source: SEJENIS "MARKAS"
en: your

source: ITU BENAR!??
en: true?!

source: pemeran
en: the main

source: JADI KAMI JUGA AKAN MELAKUKAN SESUATU TENTANG INI.
en: and we’ll do something about this.

source: TERBESARNYA JUSTRU
en: shouldn’t have picked

source: Aku ini masih harus gladi resik!!
en: I still have to rehearse!

source: SEMAKIN BANYAK KAMU TAHU, SEMAKIN DALAM JUGA KAMU TERLIBAT.
en: the more you know, the deeper you’ll get involved in this.

source: Ini diketahui
en: Most of theater club’s members

source: SEHARUSNYA
en: ...then it’s

source: MEREKA MEMANG MENCURIGAKAN,
en: they’re indeed suspicious,

source: *Kelas kosong
en: *an empty class

source: PADA BAPAK…
en: you?

source: naksir lagi
en: you had a crush

source: SEMENTARA ITU, POLITIKUS TERSEBUT DIUNTUNGKAN DARI PROFIT YANG DITAWARKAN PENGUSAHA TERSEBUT.
en: meanwhile, those politicians get tons of money by doing the favors.

source: DENGAN KUAT.
en: with confidence.

source: OKE, NANTI
en: Okay then, we’ll be

source: WAA
en: chatter

source: MAU NGAPAIN KALIAN?
en: what are you doing here?

source: KALAU KETUA
en: If you want proof,

source: MENEMPATKAN ANGGOTA-
en: surrounding

source: HAAA,
en: Phew,

source: MENURUTKU, KAU
en: you’re such

source: SOALNYA KETUA
en: Leo is known

source: DAN MATA SENIOR
en: eye contact with

source: DULUAN
en: be

source: SELALU MENGANGGAP SIFAT
en: I thought

source: JANGAN SAMPAI
en: your guard down.

source: AH, AKU TIDAK BISA KARENA SEBENTAR LAGI AKU HARUS LATIHAN TEATER.
en: guys, I have a theater rehearsal in a few minutes.

source: SUATU KEJADIAN,
en: about a particular thing,

source: PUN ORANG DI SEKITARMU
en: around here

source: LEO HANYALAH
en: Is Leo merely an

source: IZINKAN SAYA YANG MENJELASKAN.
en: let me explain.

source: MENGERTI AKAN
en: considered

source: MERASA INI AKIBAT
en: if it weren’t

source: T-TENTU,
en: S-sure...

source: ...SAYA MELAKUKANNYA DENGAN MENGAMATI KARAKTER MEREKA.
en: I just observed their characters.

source: DI SINI.
en: you here.

source: SETELAH KETUA
en: When you claimed

source: MENGETAHUI IDENTITAS
en: They don’t know the identities

source: BAIKLAH…
en: o-okay...

source: TAPI CHIARA TIDAK TAHU
en: but she has no idea that

source: ekspresi saat
en: his expression

source: ADA WAKATOS
en: she

source: PAK!
en: slap

source: AKU TIDAK MENYEBAR
en: I don’t

source: AKU TIDAK
en: Well, I don’t know

source: APA ADA
en: Maybe

source: Hedwig, lama tidak bertemu!
en: hedwig, long time no see!

source: Sudah ya,
en: We’re done here.

source: BERTENGKAR DENGAN
en: had an argument

source: Sentuh
en: touch

source: ADA KEJADIAN
en: would

source: LANGSUNG MENGHAMPIRI
en: see and

source: BANYAK SEKALI
en: I have

source: TENG-
en: ding

source: Aku harus
en: What do

source: FOKUS, FOKUS!
en: I need to focus!!!

source: HAAA!?
en: Huh?!

source: Tolong ya, Paman?
en: uncle, please...?

source: DIISI OLEH SATU SENIOR
en: consists of one senior

source: JANGAN
en: Don’t

source: PARTNER DI BIDANG
en: Of their

source: KEMARIN MUNCUL
en: Something

source: tidak perlu
en: with the

source: SEKARANG,
en: The only thing we

source: KAU INGIN
en: You really

source: CHIARA, ITU
en: Chiara, isn’t

source: BARU KALI INI
en: a theater maniac

source: ITU MEMANG HAL YANG LOGIS DILAKUKAN, BUKAN?
en: that’s the most rational thing to do, right?

source: ADALAH KELEMAHANKU.
en: a curse.

source: Pip-
en: beep

source: TAP-
en: Step

source: SEPERTI KASUS REPORTER
en: he’s just like the

source: SEKARANG CHIARA
en: There’s no way

source: SEGERA MENEMUI IBU NINA
en: and report to Mrs. Nina

source: ...BANYAK SEKALI INFORMASI YANG HARUS AKU CERNA!!
en: there’s just too much information to take in!

source: BERBAHAYA JUGA
en: dangerous for

source: KALI INI AKU MELIHAT
en: I’ve never seen him

source: KALAU BEGITU,
en: Well, then,

source: SESUATU.
en: something.

source: banget?
en: like this?

source: Pertanyaan apa ini?
en: what kind of question was that?!

source: HAL-HAL YANG MENJADI
en: know the answers

source: ITU, SKENARIONYA
en: The scenario

source: JUGA KATAMU.
en: I guess you’re right.

source: AMAN,
en: fine.

source: SIGNIFIKAN!
en: could be very significant for our investigation!

source: …INI AKAN
en: this is

source: *Chiara ganti seragam
en: *Chiara’s changed her clothes

source: BERSIMPATI
en: be more sympathetic

source: MEMBICARAKAN
en: to discuss something

source: B-BEGITU?
en: I-I see...

source: SEMBARANGAN!
en: Watch your mouth!

source: UNTUK MENJADIKAN
en: appoint a scholarship

source: Tapi mobil itu menggunakan pelindung plat yang membuat nomornya tidak terlihat jelas…
en: but the license plate was covered.

source: MENDESAK…
en: emergency...

source: KAK EZRA BEREKSPRESI
en: that serious

source: HAA…
en: sigh

source: TAP
en: step

source: PENIPUAN,
en: a scam.

source: SEKARANG ADA
en: we have

source: KALI NAKSIR ORANG!
en: you’ve have a crush on someone?!

source: DEG
en: THUMP

source: MENCARI-CARI
en: doing this

source: SEKOLAH,
en: festival.

source: DITAHAN?
en: restroom, Ezra.

source: PESAN DARI NAOMI?
en: messages from naomi?

source: TAHU APA YANG
en: wanna know

source: BILANG SESUATU
en: anything

source: HEBOH SENDIRI!??
en: being like this?!

source: AKU MEMANGGILMU
en: I’m not here

source: Kamu tenang saja dan biarkan kami mengurusnya.
en: relax. we’ll take care of it.

source: BICARAKAN KEMARIN..?
en: yesterday?

source: SEBELAHNYA UNTUK
en: class to

source: Mengirim
en: Spamming Mr. Nevada

source: CHIARA DI RUANG SEBELAH,
en: check up on her,

source: SAJA UNTUK MENGHINDARI
en: gossip and rumors,

source: SENIOR ITU?
en: her?

source: MUNGKIN KAU
en: like you

source: KALAU BEGITU
en: If that’s the case,

source: JADI SEKRETARIS OSIS.
en: tongue of yours is.

source: TIDAK DIBERITAHUKAN
en: you tell me

source: KELALAIANMU.
en: for you.

source: SENDIRI SEBELUM
en: prior

source: TIDAK BAYAR ORANG
en: just pay someone

source: Dan Papa pasti datang tolong kita, jadi Cantika tidak takut!
en: and dad will come and save us, so I’m not scared!

source: JUGA AKU MASIH
en: all of this nonsense wouldn’t have happened

source: AKU TIDAK PERNAH
en: I never thought

source: SEBAIKNYA KAMU
en: it’d better if you

source: SALAHMU, BODOH!
en: too, you know?!

source: Bersambung…
en: To be continued...

source: KETUA LEO
en: Leo

source: ADA DI
en: on your

source: ruang rahasia OSIS.
en: OSIS secret room.

source: KEPIKIRAN TENTANG
en: thinking about

source: WAKATOS DAN KETUA
en: chiara and

source: BENDAHARA I & II
en: Treasurer I & II

source: WAKATOS!
en: vice president!

source: PIKIRAN SAYA.
en: my mind ever since.

source: LAGI.
en: again.

source: OSIS DI TAHUN
en: in my third year

source: INFO-INFO ITU!??
en: about that information?!

source: GINI-GINI AKU
en: I’m the president

source: aku terus?
en: lately, huh?!

source: mengontrol responku!!
en: I can’t control my emotions!

source: HAH?
en: Huh?

source: DI SINI…
en: their conversation from here...

source: Sudah kubilang kamu boleh pergi, asalkan kamu meninggalkan Handphonemu!
en: I told you you could go, but leave your phone here!

source: AKU HANYA KHAWATIR,
en: I’m just worried.

source: KALIAN TIDAK
en: No need

source: ditendang
en: by

source: Bersambung...
en: to be continued...

source: AKU ADALAH
en: I’m really

source: Hei, dari tadi, aku menghubungimu, kenapa kau tidak angkat??
en: I’d been trying to call you. why didn’t you answer the phone?

source: tatapanku
en: look

source: SEHINGGA AKU
en: I thought that

source: LATIHAN??
en: come to practice?

source: YANG DIA KATAKAN
en: did she say to

source: PADAKU?
en: to me?

source: ANAK-ANAK KECIL BAU KENCUR,
en: hey, brats...

source: AKU TIDAK MENYANGKA MASALAHNYA SERUMIT INI!!
en: I had no idea that it’d be so complicated!

source: Dia memang anaknya Pak Nev, bicaranya pintar sekali.
en: she’s indeed mr. nev’s daughter.

source: 'kan bisa bahaya!
en: if people know about this!

source: KARENA ITU
en: That’s why you

source: AKAN MEMBAWA
en: I don’t really matter.

source: TAMPIL.
en: to their performance.

source: DIA TIDAK MEMPERINGATKANMU
en: Has he ever told you

source: …KALAU KAMU
en: well...

source: LALU.
en: something from the past.

source: SEMENTARA EZRA
en: Meanwhile, Ezra

source: DARI SISWI RAJIN
en: like

source: MUDAH UNTUK
en: be easily

source: Kau ingat 'kan orang yang kemarin mengancamku soal Bu Nina?
en: do you remember the guy who threatened me about ms. nina?

source: BEGINI!
en: anymore!

source: KELAS 11??
en: the eleventh grade?

source: TIDAK BISA SEPERTI
en: You shouldn’t do it like that.

source: MEREKA.
en: to them.

source: APA KETUA BISA
en: perhaps

source: SANDIWARA,
en: get serious.

source: selamat sore sebelumnya Pak.
en: Good afternoon, Sir.

source: WAKATOS DI GERBANG,
en: for her by the school gate,

source: MEMPERCAYAI
en: trust

source: WAKATOS YANG AKRAB
en: been avoiding

source: WAKATOS DAN EZRA
en: the Vice president

source: BIDANG,
en: divisions.

source: WAKATOS MENYENDIRI KARENA
en: They said that you’d been

source: MENYENANGKAN SEMUA
en: that can

source: AKU MENGATAKAN
en: I didn’t say

source: TAPI SEANDAINYA
en: Well, even if it wasn’t

source: MASUK.
en: please step inside.

source: BUAK!
en: Thud

source: Apa ada petunjuk lain?
en: is there any other lead?

source: KARENA TIDAK MEMBANTU UNTUK MENUTUPI KASUS ANAKNYA DI MASA KRUSIAL KARIRNYA?
en: because he refused to help him covering up his son’s case in the crucial time of his career?

source: A-Apa maksudnya..??
en: w-what do you mean?

source: KAU BENAR-
en: You really

source: SEBAGAI KETUA OSIS
en: is to claim to be the president of OSIS

source: KENAPA KAMU MENGHINDARI
en: you’ve been avoiding

source: MENGANTARKAN PROPERTI
en: is asked to bring some props

source: Kenapa-
en: why-

source: SIBUK MEMPERSIAPKAN
en: will be busy preparing

source: YANG RAJIN SEPERTI
en: like you,

source: KEMUNGKINAN BESAR, KELUARGA SANJAYA...
en: there’s strong indication that the sanjaya family...

source: MENGEKSEKUSI
en: his plan

source: KENAPA HARUS AKU
en: why should I

source: WAJAR SAJA ANAK-ANAK ITU MENGANGGAP KAMU PENJAHAT,
en: now I understand why those kids suspected you.

source: KEBENARAN DARI
en: the whole truth

source: SISTEM OSIS INI KARENA
en: this system since

source: DENGAN KAKAK
en: just

source: SUDAH TAHU
en: heard

source: LEBIH RUMIT
en: more complicated

source: SEMUA BOLEH
en: Please enjoy

source: Wakatos ya?
en: the vice president?

source: Suasananya tegang sekali...
en: it was so tense...

source: APAPUN LAGI.
en: anymore.

source: BEGITU YA…
en: I see...

source: BAGUS,
en: job.

source: ITU BAIK, KAN?
en: right?

source: AH BENAR, AYO
en: Good idea!

source: Selalu tau gosip
en: She always knows the latest

source: SEPERTI
en: I’ve never

source: MEREKA,
en: partner in their division.

source: AKU SUDAH PUNYA
en: that he

source: SEKRETARIS I OSIS.
en: Secretary I of OSIS.

source: DAN DIA MEMBERITAHU KALAU KALIAN BARU SAJA BERDISKUSI DI SINI.
en: and she told us that you guys just had a discussion here.

source: TERLIBAT SETELAH
en: to be involved after she knows

source: CERITAKAN?
en: tell you.

source: KUSELESAIKAN
en: all of

source: YA!
en: spot.

source: APA YANG SEDANG TERJADI DI SINI!??
en: what’s happening here?

source: TAU KALAU AKU TIDAK
en: that

source: MAIN-MAIN!!
en: being very serious right now!

source: JADI CHIARA,
en: So, Chiara...

source: KAK LEO BERBOHONG!
en: indeed lying to me!

source: ITU ALASAN UNTUK
en: in fact flirting with

source: Kalau butuh apa-apa, panggil saja kami ya.
en: let us know if you need anything.

source: DRRT
en: bzzt

source: YANG SAYA BILANG
en: can’t

source: KAU SUKA PEREMPUAN
en: whether you like

source: DIAM SAJA?
en: Ms. Nina!

source: ORANG YANG TERTARIK
en: interested in me

source: PERNAH BILANG APAPUN.
en: didn’t dare to tell me this.

source: tau yang sebenarnya
en: we would believe

source: DEMI
en: I did it

source: HA!
en: hahaha!

source: AKU HARUS MENGAMATI SITUASI DULU.
en: so, I have to observe the situation first.

source: BEBERAPA ANAK KELAS SATU
en: some first years

source: JANJI UNTUK BERTEMU
en: to see her

source: KEPSEK,
en: the headmaster,

source: KAMU TAHU,
en: You know,

source: KRETEK
en: crack

source: Adlib nya lancar
en: His improv is really on point!

source: JADI AKU
en: I’ve been

source: KENAPA SUARA
en: to

source: …BAIKLAH,
en: Okay,

source: KATA BEGITU!
en: anything!

source: MENGAKU PADA WAKATOS,
en: told Chiara your real identity,

source: TERUS MENGENDALIKAN
en: continue to steer

source: Aku dan anggota OSIS lainnya berasal dari keluarga yang penting, jadi pelakunya pasti masih akan lebih mempertimbangkan aksinya.
en: the other OSIS members and I are from reputable families, so the perpetrator will think about their steps more carefully.

source: YANG KAKAK
en: What are

source: SAYA SERAHKAN
en: to

source: rahasia.
en: ones.

source: TENTUNYA NAOMI
en: Naomi is qualified

source: Dia belum
en: Why’s she

source: KERAGUANMU
en: your own

source: DAN JUGA…
en: Oh, also...

source: MENGETAHUI,
en: to know that...

source: SAAT SESEORANG
en: When someone

source: SET
en: fwip

source: YANG MENYURUHNYA
en: asked him to

source: SENIORMU,
en: senior,

source: MENGAWASI DARI LUAR.
en: is keeping an eye on them from outside.

source: DARI DUGAANKU.
en: than I thought.

source: Tapi tentunya, tempat ini kami kelilingi dengan staff sekuriti dan juga anggota OSIS.
en: but of course, it’s surrounded by security staff and OSIS members.

source: INI TENTANG
en: It’s about

source: SENDIRI.
en: doubts.

source: SESUATU…
en: something came up...

source: Dik, kamu tidak apa-apa?
en: are you ok, kid?

source: PEMBERITAHUANNYA
en: short

source: TAPI UNTUK SAAT INI, BISA FOKUS DULU GAK??
en: but can you focus for now?

source: AH, AKHIRNYA
en: Ah, so you’ve finally

source: SAYA SANGAT
en: looked

source: BERANI SEKALI KAMU BICARA SEPERTI ITU?
en: how brave of you to say it in front of me.

source: MEMBUATKU HARUS
en: I trust

source: Kak Ezra!
en: Ezra!

source: …AKU TIDAK
en: I didn’t have

source: Apa kalian menemukan sesuatu?
en: did you find something?

source: KAU MUNGKIN
en: In case

source: MASIH DI SINI?
en: you still here?

source: Gawat…
en: damn...

source: KAMI BERSIH DARI
en: got

source: ...DITAMBAH LAGI, SI KEVIN ITU JUGA MENGINGATKANKU PADA SESEORANG,
en: plus, kevin kinda reminds me of someone.

source: OSIS,
en: you know.

source: BEASISWA, UNTUK MENJADI
en: a scholarship student, to be

source: RASANYA SEPERTI DIPERMAINKAN, TAHU??
en: you fooled me!

source: SETELAHNYA,
en: are only...

source: YA?
en: president?

source: MENGAWASI EKSKUL
en: monitoring the theater club,

source: Ukh!
en: ugh!

source: DARI AWAL PUN
en: from the beginning

source: ALASAN KENAPA,
en: why...

source: DIA TETAP MENGANALISA
en: she’s still able to analyze everything

source: Tadi itu,
en: it was...

source: KALIAN, BERCANDA JUGA
en: You can’t do

source: AKAN KEHILANGAN
en: trust

source: TUH,
en: There

source: KEMUDIAN DI SANA,
en: There,

source: CURIGA.
en: suspicions.

source: BUKAN AKTOR
en: a bad

source: *Improvisasi,
en: *Spontaneous

source: BAGAIMANA BISA
en: How is she

source: DIA PASTI AKAN
en: they’ll

source: PERKATAANNYA.
en: words.

source: Rupanya mereka tahu niat kami!
en: they knew it!

source: MENGANCAMKU, SUPAYA
en: get back at me, right?!

source: TAHU.
en: know.

source: BAIKLAH, AKU
en: fine!

source: Ezra terkenal
en: Ezra

source: MENGEJUTKAN.
en: really shocking.

source: TETAPI TIDAK
en: Which means,

source: SEMAKIN DALAM JUGA
en: the more you are

source: BERBINCANG-BINCANG
en: and chatted with the

source: SELALU MENDAPATKAN
en: differently since

source: Apa kamu tidak terlalu keras pada Wakatos?
en: weren’t you being too harsh on her?

source: BU NINA.
en: Ms. Nina.

source: SIAP, BERI
en: We

source: GLEK!!
en: Gulp!!!

source: SEMAKIN LANGKA
en: rare info

source: chat masuk.
en: a message.

source: BENAR-BENAR
en: something

source: SOAL INI
en: We’ll

source: Suara
en: this

source: AWAL BUKAN KEBETULAN
en: it wasn’t a coincidence

source: KEMARI??
en: me here?!

source: KALAU KITA HANYA BERASUMSI, KITA TIDAK AKAN MENEMUKAN JAWABANNYA.
en: assumptions won’t bring us any answers.

source: DAN RASA
en: So, in order to

source: SEKALIPUN KAMU BENAR, KAMU TIDAK PERLU SAMPAI MERENDAHKAN ORANG LAIN.
en: even if what you said was true, you shouldn’t belittle others.

source: KATANYA BIAR
en: The school said

source: NAOMI,
en: and Naomi...

source: HAI EZRA, KENAPA DARI TADI KAU DIAM SAJA??
en: hey, why are you so quiet?

source: KEPENTINGAN MEREKA,
en: own benefit.

source: SALAH PAHAM, AKU
en: take it the wrong way!

source: …TAPI SEBENARNYA
en: But, the truth is,

source: DENGAN ORANG LAIN!
en: sympathetic towards others!

source: DENGAN WAKATOS.
en: all of a sudden.

source: GREK
en: Scrape

source: ANGGOTA OSIS SUNGGUHAN.
en: a real member of OSIS.

source: DALAM GELAP ITU
en: what it’s like being

source: SEPERTI INI.
en: like this.

source: AYO KITA SEMUA BERJUANG MENYELESAIKAN MASALAH INI SEBELUM FESTIVAL SEKOLAH.
en: let’s do our best to solve this problem before the school festival.

source: KELEMAHANKU…
en: to me...

source: SAYA DAN KEPSEK AKAN
en: The headmaster and I

source: LIHAT TIDAK
en: Did you see

source: SAAT ITULAH,
en: so...

source: yang ditinggal
en: an abandoned

source: BAGAIMANA PUN
en: after all,

source: SESAMA LELAKI YANG
en: man who’s also

source: KALAU WAKATOS
en: that the vice president

source: DIA BAHKAN TIDAK
en: She didn’t even want

source: YANG TADI DIA
en: all

source: MAUKAH KAMU
en: would you mind listening

source: BIASANYA KAMU
en: I thought you were

source: EHEM!
en: cough

source: TIDAK SENANG?
en: uncomfortable?

source: IMAJINASIMU
en: I think your imagination

source: KENAPA DIA HARUS
en: to cover

source: AKU DAN IBUKU
en: and I have been treated

source: Ganti topik!!
en: Change the topic!

source: KALIAN??
en: “headquarters”?!

source: ARTINYA HAL
en: Hmm... I guess

source: Memangnya
en: Did I really

source: Maaf, bagaimana pun juga kami tidak akan melepaskan ikatan kalian.
en: sorry, we’re not letting you go no matter what.

source: AKAN DIBERIKAN
en: he would say

source: BERURUSAN DENGAN
en: in some OSIS bullshit

source: DIA SUDAH TAHU SAYA
en: she know that I was

source: WAH, SEPERTI
en: Whoa, as expected

source: PLAK!
en: slap

source: SESEORANG YANG
en: I think this someone

source: PUNYA KESEMPATAN…
en: chance to be with you...

source: Aku-'kan
en: I’ve told them that

source: KAMU BILANG
en: You said you weren’t

source: WAH...
en: whoa...

source: EH?
en: Huh?

source: OKE CHIARA, AKU DULUAN, YA!
en: okay, chiara. I’ll head back now!

source: Padahal saya sudah berjanji tidak akan membiarkan peristiwa Erlangga terulang lagi..!
en: in fact, I made you a promise to never let what happened to erlangga happen again.

source: RASANYA SEPERTI SEDANG
en: She must be thinking

source: AKAN MENGARAH KE HAL
en: the conversation will lead to

source: JADI-
en: so--

source: Tapi caramu bicara tadi seolah berkata "Kamu hanya akan jadi beban".
en: the way you talked sounds like she’s a burden.

source: SEPERTI SEKARANG.
en: as what he has right now.

source: Benar, aku tidak tahu cara kami bisa meloloskan diri sendiri.
en: right. we don’t know how to escape...

source: TERIMA KASIH
en: Thank you

source: DIBILANG OSIS SECARA
en: as a whole

source: KASIH PADAMU
en: to you

source: WAH, JARANG-
en: Whoa,

source: DI DALAM?
en: in there?

source: KAMI SUDAH BERDISKUSI
en: We’ve come to an agreement

source: TIK
en: tap

source: SEPERTI DIA?
en: is he?

source: TAPI SELAMA INI,
en: But, I’m sure

source: Entah kenapa
en: Why do I have a bad

source: PIKIRKAN,
en: about,

source: MASUKLAH,
en: Do come in,

source: TIDAK MUNGKIN KALIAN MENEMPATKAN ANGGOTA-ANGGOTA OSIS DI SEKITAR SAYA UNTUK MENJAGA SAYA.
en: you wouldn’t have ordered these osis members to keep me safe all this time.

source: INI TERDENGAR
en: this sound

source: U-UKH…
en: U-ugh...

source: Sssstt!!
en: Shush!

source: AYO!
en: Sure!

source: melihatmu hari ini…
en: today...

source: SAYA RASA SUDAH
en: the time has

source: Rambut gondrong.
en: he’s never cut his hair short.

source: …KENAPA SAYA
en: why didn’t

source: PRANADIPA ITU DI
en: near
